app/Controllers/Categories.php

SELECT `categories`.`id` as `catid`, `nm_cat`, `product`.`id` as `proid`, `nm_product`, `desc_product`, `stock`, `price`, `img_product`
FROM `categories`
JOIN `categories_product` ON `categories_product`.`categories_id` = `categories`.`id`
JOIN `product` ON `product`.`id` = `categories_product`.`product_id`
WHERE `categories`.`id` = '5'
---
    public function product($id = 0)
    {
        $data['title'] = 'Catagories Of Product';

        $this->builder->select('categories.id as catid, nm_cat, product.id as proid, nm_product, desc_product, stock, price, img_product');
        $this->builder->join('categories_product', 'categories_product.categories_id = categories.id');
        $this->builder->join('product', 'product.id = categories_product.product_id');
        $this->builder->where('categories.id', $id);
        $query = $this->builder->get();