app/Controllers/Home.php

SELECT *
FROM `categories`
SELECT *
FROM `product`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `product`
---
    public function index()
    {
        $data = [
            'title' => 'Home',
            'categories' => $this->CategoriesModel->findAll(),
            'product' => $this->ProductModel->paginate(6, 'product')

SELECT *
FROM `categories`
SELECT *
FROM `product`
---
    public function product()
    {
        $data = [
            'title' => 'All Product',
            'categories' => $this->CategoriesModel->findAll(),
            'product' => $this->ProductModel->findAll()

SELECT `product`.`id` as `proid`, `nm_product`, `desc_product`, `stock`, `price`, `img_product`
FROM `product`
WHERE `product`.`id` = '2'
---
    public function detail($id = 0)
    {
        $data['title'] = 'Detail Product';

        $this->builder->select('product.id as proid, nm_product, desc_product, stock, price, img_product');
        // $this->builder->join('auth_logins', 'auth_logins.user_id = users.id');
        // $this->builder->join('users', 'users.id = users.id');
        $this->builder->where('product.id', $id);
        $query = $this->builder->get();